## Assignment Files
        /Practical-02-A.pdf Assignment questions (this file).
        ./DW_dataset.csv Data file for Part A: Q1.
        ./input_DW_data.csv Data file for Q2.

# Part A: Datawarehouse


        This practical aims to develop data warehouses for data-driven applications. To do this, you
        need to use and apply some of the concepts and techniques introduced in the lectures so far.
        Use PostgreSQL database, Python and its libraries to define and set up a data warehouse for
        one data-driven application.

        The first thing to do is to install PostgreSQL on your computer. The assignment should be
        solved in Python. You can use the following packages for this assignment:
             SQLAlchemy 1.4+ will be used to connect to your database
             You need to install and import all the necessary libraries (e. g. psycopg2 drivers)
             Pandas 1.3+

        The documentation of SQLAlchemy can be found here: https://docs.sqlalchemy.org/en/14.
        There are very interesting tutorials you can go through to help you understand how to
        connect to a DB/DW, how to interact with it, etc. Use those packages as you need them.

# Q1: Data Cube

        The given dataset in the DW_dataset.csv file has data about a set of employees in a company. Use the
        data and make a multidimensional data cube so that OLAP queries can be made on the datasets. You
        store data in a PostgreSQL database. Some pre-processing of data from the original dataset is required

        to clean them, which is in line with an ETL process in developing a data warehouse. After the pre-
        processing, the data frame will look like this:

Use pandas library for data pre-processing and read_sql() function to make OLAP queries into a data
frame. Provide OLAP queries and answers to the following questions.

In [22]:
import pandas as pd
import numpy as np
import os

import matplotlib.pyplot as plt
import seaborn as sn

import sqlalchemy as db
engine = db.create_engine('postgresql://postgres:admin@localhost:5432/myData')

engine.connect()

In [23]:
df = pd.read_csv('DW_dataset.csv')
df.rename(columns=lambda x: x.strip(), inplace = True)
df.head()

,Employee ID,Name,Date of Birth,Gender,Job Title,Salary,Date Joined,Date Left,Address
0,100,Smith,12-Jan-74,M,Director,50000,01-Aug-01,NaN,"12, Green Avenue, Howth, Co. Dublin"
1,125,Jones,06-Apr-89,F,Technician,40000,01-May-01,31-Aug-02,"43, School Road, Malahide, Co. Dublin"
2,167,Davis,19-Jan-82,F,Senior Technician,50000,01-Dec-02,NaN,"10, Main Street, Naas, Co. Kildare"
3,200,O'Bien,03-May-97,M,Technician,25000,01-May-02,30-Nov-02,"Apt 02, High Court, Condalkin. Co. Dublin"
4,205,Edward,16-Nov-95,M,Technician,33000,01-Jan-01,NaN,"33, Barake Street, Clane, Co. Kildare"

In [24]:
df['Job Title'] = df['Job Title'].str.strip()
df['Gender'] = df['Gender'].str.strip()
df[['Address', 'County']] = df["Address"].str.split(r"\bCo\b", expand=True)
df['County']=df['County'].str.replace(r'.',"", regex=True)
df['Date of Birth'] =  pd.to_datetime(df['Date of Birth'], infer_datetime_format=True)
df['Date Joined'] =  pd.to_datetime(df['Date Joined'], infer_datetime_format=True)
df['Date Left'] =  pd.to_datetime(df['Date Left'], infer_datetime_format=True)

def getJobCategory(x):
    y = x.split(' ');
    if 'Technician' in y:
        return 'Technical'
    elif 'Director' in y:
        return 'Management'
    elif 'Manager' in y:
        return 'Management'

df['Job Category'] = df["Job Title"].apply(getJobCategory)
df.head()
df = df.drop(['Address', 'Job Title'], axis=1)
df.head()

,Employee ID,Name,Date of Birth,Gender,Salary,Date Joined,Date Left,County,Job Category
0,100,Smith,1974-01-12,M,50000,2001-08-01,NaT,Dublin,Management
1,125,Jones,1989-04-06,F,40000,2001-05-01,2002-08-31,Dublin,Technical
2,167,Davis,1982-01-19,F,50000,2002-12-01,NaT,Kildare,Technical
3,200,O'Bien,1997-05-03,M,25000,2002-05-01,2002-11-30,Dublin,Technical
4,205,Edward,1995-11-16,M,33000,2001-01-01,NaT,Kildare,Technical

In [25]:
def write_dataset(name,dataset,engine):
    dataset.to_sql('%s' % (name),engine,index=True,if_exists='replace',chunksize=1000)

write_dataset('myData', df, engine)

In [26]:
def read_dataset(name,engine):
    try:
        dataset = pd.read_sql_table(name,engine)
    except:
        dataset = pd.DataFrame([])
    return dataset

read_dataset('myData', engine)

,index,Employee ID,Name,Date of Birth,Gender,Salary,Date Joined,Date Left,County,Job Category
0,0,100,Smith,1974-01-12,M,50000,2001-08-01,NaT,Dublin,Management
1,1,125,Jones,1989-04-06,F,40000,2001-05-01,2002-08-31,Dublin,Technical
2,2,167,Davis,1982-01-19,F,50000,2002-12-01,NaT,Kildare,Technical
3,3,200,O'Bien,1997-05-03,M,25000,2002-05-01,2002-11-30,Dublin,Technical
4,4,205,Edward,1995-11-16,M,33000,2001-01-01,NaT,Kildare,Technical
5,5,216,Evans,1995-03-22,F,44000,2001-08-01,2002-03-31,Kildare,Technical
6,6,220,Moore,1996-06-28,F,33000,2002-01-01,NaT,Dublin,Technical
7,7,301,Rogers,1975-11-14,M,60000,2002-05-01,NaT,Dublin,Management
8,8,303,Phillip,1976-10-14,F,75000,2002-01-01,NaT,Dublin,Management
9,9,344,Shane,1986-07-06,M,50000,2001-01-01,2002-04-30,Dublin,Management
10,10,351,Alan,1973-05-22,M,80000,2001-04-01,NaT,Kildare,Management
11,11,364,Gary,1981-11-11,M,85000,2001-01-01,2022-03-31,Kildare,Management
12,12,371,Robert,1993-01-27,M,27000,2001-01-01,2021-10-31,Dublin,Technical
13,13,380,Jason,1981-02-28,M,45000,2001-02-02,NaT,Dublin,Technical
14,14,393,Marry,1976-05-18,F,70000,2001-01-01,2022-11-30,Dublin,Management
15,15,409,Hilary,1988-06-15,F,78000,2001-03-01,NaT,Kildare,Management

### Q1 (1)

In [29]:

result = engine.execute('SELECT "Gender", AVG("Salary") FROM "myData"  GROUP BY "Gender"')

for row in result:
    print('Avg Salary of %s: %d' % (row[0], row[1]))

Avg Salary of M: 50555
Avg Salary of F: 55714

### Q1 (2)

Calculate the average salaries of employees between the counties of Kildare and Dublin. Then calculate the average salary by gender and by county

In [30]:

result = engine.execute('SELECT "County", AVG("Salary") FROM "myData" GROUP BY "County"')
for row in result:
    print('Avg Salary of %s: %d' % (row[0], row[1]))

result = engine.execute('SELECT "County", "Gender", AVG("Salary") FROM "myData" GROUP BY "County","Gender"')
for row in result:
    print('Avg Salary of',row[0], row[1],row[2])

Avg Salary of  Kildare: 61666
Avg Salary of  Dublin: 47500
Avg Salary of  Kildare M 66000.000000000000
Avg Salary of  Dublin M 42833.333333333333
Avg Salary of  Dublin F 54500.000000000000
Avg Salary of  Kildare F 57333.333333333333

### Q1 (3)
Calculate the average salary of management staff for males and females separately.

In [31]:

result = engine.execute('SELECT substring(cast(extract(year from "Date of Birth") AS VARCHAR(10)), 1,3), COUNT(*) FROM "myData" WHERE "Date Left" IS NULL GROUP BY SUBSTRING(CAST(extract(year from "Date of Birth") AS VARCHAR(10)), 1, 3)', ('myData'))

for row in result:
    print('# of Employees at the end of 2022 born in %s0s: %d' % (row[0], row[1]))

# of Employees at the end of 2022 born in 1970s: 4
# of Employees at the end of 2022 born in 1980s: 3
# of Employees at the end of 2022 born in 1990s: 2

### Q1 (4)

If the employee retention rate is the % of staff who stayed during a period (compared to the beginning of that period), what are the employee retention rates in 2001 and 2002?

In [32]:
import psycopg2 as pg
import pandas.io.sql as psql
dfrr = psql.read_sql('SELECT * FROM "myData"', engine)
dfrr['Date Joined'] = pd.to_datetime(dfrr['Date Joined'], format='%d-%b-%y')
dfrr['Date Left'] = pd.to_datetime(dfrr['Date Left'], format='%d-%b-%y')

In [33]:
#For 2001 using SQL
query = 'SELECT COUNT(*) FROM "myData" WHERE "Date Joined" <= %s'
df1 = pd.read_sql(query, engine, params=('2001-01-01',))
query = 'SELECT COUNT(*) FROM "myData" WHERE ("Date Joined" <= %s) AND ("Date Left" >= %s OR "Date Left" IS NULL)'
df2 = pd.read_sql(query, engine, params=('2001-01-01','2002-01-01',))
print('Retention Rate in 2001: %.2f' % (int(df2['count'])*100/int(df1['count'])))

#For 2001 using Python
df1 = dfrr[dfrr['Date Joined'] <= pd.to_datetime('01-JAN-2001', format='%d-%b-%Y')]
df2 = df1[(df1['Date Left'] >= pd.to_datetime('01-JAN-2002', format='%d-%b-%Y')) | (df1['Date Left'].isnull())]

print('Retention Rate in 2001: %.2f' % (len(df2)*100/len(df1)))

Retention Rate in 2001: 100.00
Retention Rate in 2001: 100.00

In [34]:
#For 2002 using SQL
query = 'SELECT COUNT(*) FROM "myData" WHERE ("Date Joined" <= %s) AND ("Date Left" >= %s OR "Date Left" IS NULL)'
df1 = pd.read_sql(query, engine, params=('2002-01-01','2002-01-01'))
query = 'SELECT COUNT(*) FROM "myData" WHERE ("Date Joined" <= %s) AND ("Date Left" >= %s OR "Date Left" IS NULL)'
df2 = pd.read_sql(query, engine, params=('2002-01-01','2003-01-01',))
print('Retention Rate in 2002: %.2f' % (int(df2['count'])*100/int(df1['count'])))

#For 2002 using Python
df1 = dfrr[(dfrr['Date Joined'] <= pd.to_datetime('01-JAN-2002', format='%d-%b-%Y')) & ((dfrr['Date Left'] >= pd.to_datetime('01-JAN-2002', format='%d-%b-%Y')) | (dfrr['Date Left'].isnull() ))]
df2 = df1[(df1['Date Left'] >= pd.to_datetime('01-JAN-2003', format='%d-%b-%Y')) | (df1['Date Left'].isnull())]

print('Retention Rate in 2002: %.2f' % (len(df2)*100/len(df1)))

Retention Rate in 2002: 76.92
Retention Rate in 2002: 76.92

### Q1 (5) 
Show the retention rates based on the quarter of the years 2001 and 2002.

In [35]:
#For 2002 Q1
df1 = dfrr[(dfrr['Date Joined'] <= pd.to_datetime('01-JAN-2002', format='%d-%b-%Y')) & ((dfrr['Date Left'] >= pd.to_datetime('01-JAN-2002', format='%d-%b-%Y')) | (dfrr['Date Left'].isnull() ))]
df2 = df1[(df1['Date Left'] >= pd.to_datetime('01-APR-2002', format='%d-%b-%Y')) | (df1['Date Left'].isnull())]

print('Retention Rate in 2002 Q1: %.2f' % (len(df2)*100/len(df1)))

Retention Rate in 2002 Q1: 92.31